package chapter06_EX_01;

public class Using_Class_01 {

	public static void main(String[] args) {
		// 절차지향 프로그램: C언어, 시간의 순서에 따라서 프로그래밍 하는 방식  
			// 람보르기니: 한 공장에서 모든 제품을 완성, 성능 좋음, 제작 어려움
			//			고장이 났을 때, 생산된 공장에서만 수리 가능(모두 분해 → 다시 제작) 
		
		// 객체지향 프로그램(OOP): Java, 프로그램을 객체, 객체, 객체
			// 일반 자동차: 자동차의 부품을 표준화, 타이어(객체), 유리(객체), 엔진(객체), 핸들(객체) 등등 부품을 각각 만들어 조립하는 형식으로 제품을 생산 
			//			개발하기 쉬움, 수리하기 쉬움(고장이 날 경우, 해당 제품을 교체하면 됨)
		
		// 1. 클래스 내부의 요소들
				// 필드
				// 생성자 
				// 메소드
				// 이너클래스(내부 클래스)
			
		// 2. 클래스 외부의 요소들
				// 패키지
				// 임포트
				// 외부 클래스
		
		
		
		
		
	}

}
